In [19]:
import numpy as np
import pandas as pd

## Pandas series 
Basic arguments are data and labels.

In [20]:
labels = ['a', 'b', 'c', 'd']
data = [1, 2, 3, 4]
arr = np.array(data)
dic = {'a':1, 'b':2, 'c':3, 'd':4}

python list can be passed as a data, and another list as a label

In [21]:
pd.Series(data=data, index=labels)

a    1
b    2
c    3
d    4
dtype: int64

Numpy array can be passed as a data

In [22]:
pd.Series(data=arr, index=labels)

a    1
b    2
c    3
d    4
dtype: int32

Also just python dictionary can be passed as labeled data

In [23]:
pd.Series(dic)

a    1
b    2
c    3
d    4
dtype: int64

### Taking info from series by label

In [24]:
ser1 = pd.Series([[256,0,0],[0,256,0],[0,0,256]],['red','green','blue'])
ser1

red      [256, 0, 0]
green    [0, 256, 0]
blue     [0, 0, 256]
dtype: object

To get data that is described by specific label, just put the label in brackets

In [25]:
ser1['red']

[256, 0, 0]

## Data Frames

Data frames are built with pandas series, it supports number of columns which can be labeled

In [26]:
np.random.seed(101)

In [27]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Choosing columns from data frame

To chose single column, put its name into a sq brackets

In [28]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

To choose multiple columns puts a list with names in brackets

In [29]:
df[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

### Creating a new column in data frame

To create new column put its name in sq brackets and assign list of values for that column.

It can be also done by choosing an existing columns and for example adding them

In [30]:
df['new1'] = [1,2,3,4,5]
df['new2'] = df['Y'] + df['Z']

In [31]:
df

          W         X         Y         Z  new1      new2
A  2.706850  0.628133  0.907969  0.503826     1  1.411795
B  0.651118 -0.319318 -0.848077  0.605965     2 -0.242112
C -2.018168  0.740122  0.528813 -0.589001     3 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057     4  0.021819
E  0.190794  1.978757  2.605967  0.683509     5  3.289476

### Removing columns or rows

To remove row or column use .drop method and pass its name in brackets. it is needed to specify what axis should be removed, 0 is default which means that row will be deleted, for column type axis=1

data frame without removed entity is not overwrited by default, you need assign it to new variable

In [32]:
df2 = df.drop('D')
df2 = df.drop('new2',axis=1)

In [33]:
df2

          W         X         Y         Z  new1
A  2.706850  0.628133  0.907969  0.503826     1
B  0.651118 -0.319318 -0.848077  0.605965     2
C -2.018168  0.740122  0.528813 -0.589001     3
D  0.188695 -0.758872 -0.933237  0.955057     4
E  0.190794  1.978757  2.605967  0.683509     5

In [34]:
df

          W         X         Y         Z  new1      new2
A  2.706850  0.628133  0.907969  0.503826     1  1.411795
B  0.651118 -0.319318 -0.848077  0.605965     2 -0.242112
C -2.018168  0.740122  0.528813 -0.589001     3 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057     4  0.021819
E  0.190794  1.978757  2.605967  0.683509     5  3.289476

If you want to overwrite data frame without removed series, type parameter "inplace=True"

In [35]:
df.drop('new1', axis=1, inplace=True)

In [36]:
df

          W         X         Y         Z      new2
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

### Choosing rows from data frame